Tekla Open API Reference for Tekla Structures 2025
DrawingHatchColors Enumeration
 The hatch colors used in Tekla.Structures.Drawing.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum DrawingHatchColors
Public Enumeration DrawingHatchColors
Members
Member name | Value | Description
Invisible | 152 |  The light gray color: the "invisible color". Light gray is visible only on the screen and not in printed or exported drawings.
Black | 153 |  The black color.
NewLine1 | 154 |  The brown color.
NewLine2 | 155 |  The green color.
NewLine3 | 156 |  The dark blue color.
NewLine4 | 157 |  The forest green color.
NewLine5 | 158 |  The orange color.
NewLine6 | 159 |  The gray color.
Red | 160 |  The red color.
Green | 161 |  The bright green color.
Blue | 162 |  The blue color.
Cyan | 163 |  The turquoise color.
Yellow | 164 |  The yellow color.
Magenta | 165 |  The magenta color.
Special | 120 |  Obsolete.  The special color (deprecated). Defined with advanced options XS_HATCH_SPECIAL_COLOR_R, XS_HATCH_SPECIAL_COLOR_G and XS_HATCH_SPECIAL_COLOR_B.
Gray30 | 130 |  The Gray30 rgb(0.3, 0.3, 0.3) color.
Gray50 | 131 |  The Gray50 rgb(0.5, 0.5, 0.5) color.
Gray70 | 132 |  The Gray70 rgb(0.7, 0.7, 0.7) color.
Gray90 | 133 |  The Gray90 rgb(0.9, 0.9, 0.9) color.
See Also
Reference
Tekla.Structures.Drawing Namespace